Revit 2024 API
BuiltInFailures.CurtainWallFailures.CurtainGridOffHost Property
 Curtain grid has left its host.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CurtainGridOffHost { get; }
Visual Basic
Public Shared ReadOnly Property CurtainGridOffHost As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CurtainGridOffHost {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.CurtainWallFailures Class
Autodesk.Revit.DB Namespace